notes/meeting_2021dec19.md
- [meeting notes December 19, 2021](#org0f17cc4)
  - [the raku study group](#orgb8a54bd)
    - [celebrate the hollowdaze with the Raku-ettes](#org3b18717)
  - [usual links](#org1a43270)
    - [<https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021dec19.md>](#orgda31bfa)
    - [<https://github.com/doomvox/raku-study/bin/2021dec19>](#orga4e5241)
  - [topicettes](#orga4ff536)
    - [idea for a new utility package](#org75b5881)
    - [phasers perl6-users discussion](#orgf845dbf)
    - [stackoverflow question about deepmap](#org52e9160)
  - [announcments](#org7d49200)
    - [January 2nd: next meeting?  (actually: I'm thinking I may skip this one)](#orgcd556ef)
    - [January 6th: svlug: I'll be talking about Raku](#orgc729123)


<a id="org0f17cc4"></a>

# meeting notes December 19, 2021


<a id="orgb8a54bd"></a>

## the raku study group


<a id="org3b18717"></a>

### celebrate the hollowdaze with the Raku-ettes


<a id="org1a43270"></a>

## usual links


<a id="orgda31bfa"></a>

### <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021dec19.md>


<a id="orga4e5241"></a>

### <https://github.com/doomvox/raku-study/bin/2021dec19>


<a id="orga4ff536"></a>

## topicettes


<a id="org75b5881"></a>

### idea for a new utility package

1.  <https://raku-advent.blog/2021/12/11/unix_philosophy_without_leftpad_part2/>

2.  wants to name it "\_" or "lowbar"

    1.  because calling it "util" would be confusing
    
    2.  very specific rules for the package without any ideas of what to put in it
    
    3.  complicated thinking justifying the underlying philosophy, based on observations of programmer behavior


<a id="orgf845dbf"></a>

### phasers perl6-users discussion

1.  my access to the list is mangled, I don't get mail from it

2.  the archived form of this discussion is mangled

    1.  (refers to a Yary comment that isn't there)
    
        1.  <https://www.nntp.perl.org/group/perl.perl6.users/2021/12/msg10332.html>
        
        2.  


<a id="org52e9160"></a>

### stackoverflow question about deepmap

1.  <https://stackoverflow.com/questions/70414736/immutable-uncontainerized-elements-in-arrays-created-by-deepmap>


<a id="org7d49200"></a>

## announcments


<a id="orgcd556ef"></a>

### January 2nd: next meeting?  (actually: I'm thinking I may skip this one)


<a id="orgc729123"></a>

### January 6th: svlug: I'll be talking about Raku
